#include "main.h"

static struct trap_i {
	const char*		name;
	attackinfo		attack;
} trap_data[] = {
	{""}, // Нет ловушки
{"Змеинная яма", {0, 0, {1, 6}}},
{"Яма с кислотой", {0, 0, {3, 18}}},
{"Самострел", {0, 0, {1, 6}}},
{"Проклятое место", {0, 0, {1, 6}}},
{"Плита под напряжением", {0, 0, {3, 18}}},
{"Огненная плита", {0, 0, {3, 18}}},
{"Плита света", {0, 0, {1, 6}}},
{"Яма", {0, 0, {1, 6}}},
{"Яма с копьями", {0, 0, {2, 12}}},
{"Стрельба копьем", {0, 0, {1, 8}}},
{"Выезжающие ножи", {0, 0, {1, 6}}},
{"Корррозийные испарения", {0, 0, {1, 3}}},
{"Гейзер", {0, 0, {1, 6}}},
};
assert_enum(trap, TrapWater);
getstr_enum(trap);

const attackinfo& getattackinfo(trap_s value) {
	return trap_data[value].attack;
}